#encoding:utf-8
#==============================================================================
# ■ Sprite_Explosion
#------------------------------------------------------------------------------
#  显示音符击打特效的精灵组
#==============================================================================

#--------------------------------------------------------------------------
# ● Sprite_Explosion_Upper
#
#   显示音符击打特效的精灵（上层），在 Spriteset_Explosion 内部使用
#--------------------------------------------------------------------------
class Sprite_Explosion_Upper < Sprite_Anime
  #--------------------------------------------------------------------------
  # ● 设置精灵的位图
  #--------------------------------------------------------------------------
  def get_bitmap(bitmap)
    Cache.skin("explosion_upper")
  end
  #--------------------------------------------------------------------------
  # ● 设置帧的高度
  #--------------------------------------------------------------------------
  def frame_height
    self.bitmap.height / 4
  end
  #--------------------------------------------------------------------------
  # ● 设置当前帧Y坐标
  #--------------------------------------------------------------------------
  def frame_y
    @frame_y || 0
  end
  #--------------------------------------------------------------------------
  # ● 重置并显示特效
  #--------------------------------------------------------------------------
  def reset_and_show(type)
    @duration = 0
    @frame = 0
    @frame_y = self.bitmap.height / 4 * type
    set_frame
    show
  end
end
#--------------------------------------------------------------------------
# ● Sprite_Explosion_Lower
#
#   显示音符击打特效的精灵（下层），在 Spriteset_Explosion_Upper 内部使用
#--------------------------------------------------------------------------
class Sprite_Explosion_Lower < Sprite_Explosion_Upper
  #--------------------------------------------------------------------------
  # ● 设置精灵的位图
  #--------------------------------------------------------------------------
  def get_bitmap(bitmap)
    Cache.skin("explosion_lower")
  end
end
#--------------------------------------------------------------------------
# ● Spriteset_Explosion
#
#   显示音符击打特效的精灵组
#--------------------------------------------------------------------------
class Spriteset_Explosion < Spriteset_M5
  #--------------------------------------------------------------------------
  # ● 初始化
  #--------------------------------------------------------------------------
  def initialize(viewport_upper = nil,viewport_lower = nil)
    @sprite_upper = Sprite_Explosion_Upper.new(viewport_upper,
      {x: upper_pos_x, y: upper_pos_y, z: upper_pos_z},
      {frame: upper_frame_max, duration: upper_duration_time})
    @sprite_lower = Sprite_Explosion_Lower.new(viewport_lower,
      {x: lower_pos_x, y: lower_pos_y, z: lower_pos_z},
      {frame: lower_frame_max, duration: lower_duration_time})
  end
  #--------------------------------------------------------------------------
  # ● 上层特效X坐标
  #--------------------------------------------------------------------------
  def upper_pos_x; Skin_Setting.setting(:ExplosionUpperX); end
  #--------------------------------------------------------------------------
  # ● 上层特效Y坐标
  #--------------------------------------------------------------------------
  def upper_pos_y; Skin_Setting.setting(:ExplosionUpperY); end
  #--------------------------------------------------------------------------
  # ● 上层特效帧数
  #--------------------------------------------------------------------------
  def upper_frame_max; Skin_Setting.setting(:ExplosionUpperFrame); end
  #--------------------------------------------------------------------------
  # ● 上层特效持续时间
  #--------------------------------------------------------------------------
  def upper_duration_time; 1; end
  #--------------------------------------------------------------------------
  # ● 上层特效Z坐标
  #--------------------------------------------------------------------------
  def upper_pos_z; 0; end
  #--------------------------------------------------------------------------
  # ● 下层特效X坐标
  #--------------------------------------------------------------------------
  def lower_pos_x; Skin_Setting.setting(:ExplosionLowerX); end
  #--------------------------------------------------------------------------
  # ● 下层特效Y坐标
  #--------------------------------------------------------------------------
  def lower_pos_y; Skin_Setting.setting(:ExplosionLowerY); end
  #--------------------------------------------------------------------------
  # ● 下层特效帧数
  #--------------------------------------------------------------------------
  def lower_frame_max; Skin_Setting.setting(:ExplosionLowerFrame); end
  #--------------------------------------------------------------------------
  # ● 下层特效持续时间
  #--------------------------------------------------------------------------
  def lower_duration_time; 1; end
  #--------------------------------------------------------------------------
  # ● 下层特效Z坐标
  #--------------------------------------------------------------------------
  def lower_pos_z; 100; end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    super
    @sprite_upper.update
    @sprite_lower.update
    return unless Taiko.last_hit
    return if @finish == Taiko.last_hit.time
    return if Taiko.last_hit.performance == :miss
    return unless [1,2,3,4].include? Taiko.last_hit.type
    type = Taiko.last_hit.performance == :perfect ? 0 : 1
    type += Taiko.last_hit.type < 3 ? 0 : 2
    @finish = Taiko.last_hit.time
    @sprite_upper.reset_and_show(type)
    @sprite_lower.reset_and_show(type)
  end
  #--------------------------------------------------------------------------
  # ● 释放
  #--------------------------------------------------------------------------
  def dispose
    super
    @sprite_upper.dispose
    @sprite_lower.dispose
  end
end