# encoding: utf-8

require 'view/score/base'

# 显示分数增加量

module View
  class Score
    class Add < Base

      def get_bitmap
        Cache.score_numbers("font_m_red")
      end
      #--------------------------------------------------------------------------
      # ● 数字 X 坐标
      #--------------------------------------------------------------------------
      def pos_x; SkinSettings.fetch(:ScoreX2); end
      #--------------------------------------------------------------------------
      # ● 数字 Y 坐标
      #--------------------------------------------------------------------------
      def pos_y; SkinSettings.fetch(:ScoreY2); end
      #--------------------------------------------------------------------------
      # ● 设置数字变更时的特效
      #--------------------------------------------------------------------------
      def set_change_effect
        @change_effect = [10]
        @number_list.each{|s| s.x -= @change_effect[0]}
      end
      #--------------------------------------------------------------------------
      # ● 更新数字变更时的特效
      #--------------------------------------------------------------------------
      def update_change_effect
        if @change_effect[0] > 0
          @number_list.each{|s| s.x += 2}
          @change_effect[0] -= 2
        end
      end
    end
  end
end