# encoding: utf-8

require 'view/animation'

module View
  class Play
    class Explosion
      class Base < Animation
        #--------------------------------------------------------------------------
        # ● 设置帧的高度
        #--------------------------------------------------------------------------
        def frame_height
          self.bitmap.height / 4
        end
        #--------------------------------------------------------------------------
        # ● 设置当前帧Y坐标
        #--------------------------------------------------------------------------
        def frame_y
          @frame_y || 0
        end
        #--------------------------------------------------------------------------
        # ● 重置并显示特效
        #--------------------------------------------------------------------------
        def reset_and_show(type)
          @duration = 0
          @frame = 0
          @frame_y = self.bitmap.height / 4 * type
          set_frame
          show
        end
      end
    end
  end
end